Satachito/SliP/Tab5/sdkconfig.defaults
#	M5Stack Tab5 ( ESP32-P4, revision v1.3, 16 MB flash, PSRAM on board ).
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

#	Not optional.  The interpreter reports every error by throwing, and dispatches
#	on type through dynamic_pointer_cast; without these two the build does not
#	compile, let alone run.
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_RTTI=y

#	-Os.  There is 16 MB of flash here and no shortage of it, but a smaller image
#	is a faster flash cycle, and a REPL waiting on a person is not short of
#	cycles either.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

#	The console is the chip's own USB, not a UART: there is no serial adapter on
#	this board to be a UART for it.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

#	The REPL task owns core 1 for as long as an evaluation takes, so core 1's idle
#	task cannot be a watchdog deadline.  Core 0 keeps both its idle task and its
#	watchdog, so a hang in the system side is still caught.
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n

#	app_main only spawns the REPL task; the REPL's own stack is set in main.cpp.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

#	This board's P4 is revision v1.3, and ESP-IDF 5.5 defaults to v3.1 and above.
#	The two are not one family with a bugfix between them — the Kconfig says
#	"support of rev <3.0 and >=3.0 is mutually exclusive", and a binary built for
#	one is refused by the other at flash time. So the older side is asked for
#	explicitly rather than left to a default that assumes a newer chip.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

#	PSRAM. Not needed by the language — 536 KB of internal RAM is more than the
#	interpreter asks for — but a frame buffer for 720x1280 is 1.8 MB, so the
#	panel cannot start without it.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
